logs/fio/scsi/vhost2c/4K2_s1_c32_q4_0_mq1_v2_f4.log
precondition: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
rand-read-4K-qd1: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-write-4K-qd1: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-read-4K-qd16: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-write-4K-qd16: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-rw-4K-qd16: (g=5): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-read-4K-qd128: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-write-4K-qd128: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-rw-4K-qd128: (g=8): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 27 processes

precondition: (groupid=0, jobs=1): err= 0: pid=1585: Thu Jul 18 21:55:03 2019
  write: IOPS=19.5k, BW=2438MiB/s (2557MB/s)(35.7GiB/15001msec)
    slat (usec): min=5, max=762, avg= 8.12, stdev= 3.26
    clat (usec): min=192, max=1843, avg=809.10, stdev=42.15
     lat (usec): min=200, max=1851, avg=817.97, stdev=42.21
    clat percentiles (usec):
     | 10.000th=[  791], 20.000th=[  799], 30.000th=[  799], 40.000th=[  799],
     | 50.000th=[  799], 70.000th=[  807], 90.000th=[  832], 99.000th=[  922],
     | 99.900th=[ 1385], 99.990th=[ 1745], 99.999th=[ 1795]
   bw (  MiB/s): min= 1850, max= 2410, per=78.91%, avg=1924.29, stdev=96.05, samples=29
   iops        : min=14800, max=19283, avg=15393.90, stdev=768.39, samples=29
  lat (usec)   : 250=0.04%, 500=0.08%, 750=0.09%, 1000=99.48%
  lat (msec)   : 2=0.31%
  cpu          : usr=12.44%, sys=21.34%, ctx=291791, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,292636,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
rand-read-4K-qd1: (groupid=1, jobs=1): err= 0: pid=1594: Thu Jul 18 21:55:03 2019
   read: IOPS=47.9k, BW=187MiB/s (196MB/s)(5615MiB/30001msec)
    slat (usec): min=2, max=751, avg= 3.81, stdev= 2.00
    clat (nsec): min=1233, max=782729, avg=14260.29, stdev=4630.98
     lat (usec): min=14, max=789, avg=18.69, stdev= 5.18
    clat percentiles (usec):
     | 10.000th=[   14], 20.000th=[   14], 30.000th=[   14], 40.000th=[   14],
     | 50.000th=[   14], 70.000th=[   15], 90.000th=[   16], 99.000th=[   24],
     | 99.900th=[   41], 99.990th=[   49], 99.999th=[  750]
   bw (  KiB/s): min=135534, max=179992, per=91.03%, avg=174480.17, stdev=8947.34, samples=59
   iops        : min=33883, max=44998, avg=43619.66, stdev=2236.83, samples=59
  lat (usec)   : 2=0.06%, 4=0.01%, 10=0.03%, 20=98.74%, 50=1.15%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=23.21%, sys=34.22%, ctx=1435977, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1437548,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write-4K-qd1: (groupid=2, jobs=1): err= 0: pid=1595: Thu Jul 18 21:55:03 2019
  write: IOPS=45.6k, BW=178MiB/s (187MB/s)(5350MiB/30001msec)
    slat (usec): min=2, max=800, avg= 3.63, stdev= 2.59
    clat (nsec): min=1277, max=767425, avg=15580.38, stdev=4237.88
     lat (usec): min=15, max=818, avg=19.82, stdev= 5.08
    clat percentiles (usec):
     | 10.000th=[   15], 20.000th=[   15], 30.000th=[   16], 40.000th=[   16],
     | 50.000th=[   16], 70.000th=[   16], 90.000th=[   17], 99.000th=[   26],
     | 99.900th=[   42], 99.990th=[   51], 99.999th=[  750]
   bw (  KiB/s): min=159236, max=169680, per=91.01%, avg=166168.37, stdev=3068.38, samples=59
   iops        : min=39809, max=42420, avg=41541.81, stdev=767.08, samples=59
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=98.66%, 50=1.32%
  lat (usec)   : 100=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=19.99%, sys=33.48%, ctx=1369035, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1369480,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-read-4K-qd16: (groupid=3, jobs=4): err= 0: pid=1599: Thu Jul 18 21:55:03 2019
   read: IOPS=213k, BW=831MiB/s (871MB/s)(24.3GiB/30001msec)
    slat (usec): min=2, max=783, avg=12.50, stdev= 6.74
    clat (usec): min=18, max=3587, avg=58.75, stdev=23.21
     lat (usec): min=22, max=3604, avg=72.07, stdev=25.59
    clat percentiles (usec):
     | 10.000th=[   41], 20.000th=[   46], 30.000th=[   49], 40.000th=[   52],
     | 50.000th=[   53], 70.000th=[   59], 90.000th=[   87], 99.000th=[  128],
     | 99.900th=[  202], 99.990th=[  758], 99.999th=[  832]
   bw (  KiB/s): min=23905, max=225072, per=18.87%, avg=160515.90, stdev=37367.51, samples=236
   iops        : min= 5976, max=56268, avg=40128.57, stdev=9341.92, samples=236
  lat (usec)   : 20=0.01%, 50=34.08%, 100=60.93%, 250=4.92%, 500=0.06%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=28.93%, sys=70.17%, ctx=190592, majf=0, minf=55
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=6379745,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write-4K-qd16: (groupid=4, jobs=4): err= 0: pid=1603: Thu Jul 18 21:55:03 2019
  write: IOPS=222k, BW=868MiB/s (910MB/s)(25.4GiB/30001msec)
    slat (usec): min=2, max=24041, avg=11.40, stdev=12.23
    clat (usec): min=12, max=24088, avg=56.42, stdev=37.83
     lat (usec): min=23, max=24098, avg=68.65, stdev=41.86
    clat percentiles (usec):
     | 10.000th=[   38], 20.000th=[   41], 30.000th=[   43], 40.000th=[   46],
     | 50.000th=[   49], 70.000th=[   57], 90.000th=[   87], 99.000th=[  163],
     | 99.900th=[  347], 99.990th=[  758], 99.999th=[  873]
   bw (  KiB/s): min=44392, max=277473, per=22.19%, avg=197108.31, stdev=58497.86, samples=236
   iops        : min=11098, max=69368, avg=49276.74, stdev=14624.49, samples=236
  lat (usec)   : 20=0.01%, 50=54.75%, 100=37.88%, 250=7.18%, 500=0.18%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=30.29%, sys=68.47%, ctx=222660, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,6663767,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-rw-4K-qd16: (groupid=5, jobs=4): err= 0: pid=1612: Thu Jul 18 21:55:03 2019
   read: IOPS=161k, BW=629MiB/s (660MB/s)(18.4GiB/30001msec)
    slat (usec): min=2, max=2559, avg=10.98, stdev= 6.96
    clat (usec): min=12, max=2591, avg=54.37, stdev=22.12
     lat (usec): min=21, max=2609, avg=66.15, stdev=24.53
    clat percentiles (usec):
     | 10.000th=[   38], 20.000th=[   41], 30.000th=[   44], 40.000th=[   46],
     | 50.000th=[   48], 70.000th=[   55], 90.000th=[   84], 99.000th=[  133],
     | 99.900th=[  174], 99.990th=[  750], 99.999th=[  824]
   bw (  KiB/s): min=48801, max=199661, per=19.46%, avg=125393.25, stdev=42770.17, samples=236
   iops        : min=12200, max=49915, avg=31347.92, stdev=10692.53, samples=236
  write: IOPS=69.1k, BW=270MiB/s (283MB/s)(8093MiB/30001msec)
    slat (usec): min=2, max=758, avg=11.25, stdev= 6.96
    clat (usec): min=13, max=2599, avg=54.23, stdev=22.99
     lat (usec): min=17, max=2605, avg=66.29, stdev=25.40
    clat percentiles (usec):
     | 10.000th=[   38], 20.000th=[   41], 30.000th=[   43], 40.000th=[   46],
     | 50.000th=[   48], 70.000th=[   55], 90.000th=[   85], 99.000th=[  135],
     | 99.900th=[  178], 99.990th=[  758], 99.999th=[  840]
   bw (  KiB/s): min=20935, max=85826, per=19.45%, avg=53735.53, stdev=18263.65, samples=236
   iops        : min= 5233, max=21456, avg=13433.47, stdev=4565.89, samples=236
  lat (usec)   : 20=0.01%, 50=57.68%, 100=37.01%, 250=5.30%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 4=0.01%
  cpu          : usr=31.11%, sys=67.74%, ctx=226140, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=4832800,2071703,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read-4K-qd128: (groupid=6, jobs=4): err= 0: pid=1625: Thu Jul 18 21:55:03 2019
   read: IOPS=215k, BW=841MiB/s (882MB/s)(24.7GiB/30001msec)
    slat (usec): min=2, max=24218, avg=12.39, stdev=15.27
    clat (usec): min=13, max=24651, avg=577.88, stdev=177.96
     lat (usec): min=20, max=24680, avg=591.05, stdev=179.67
    clat percentiles (usec):
     | 10.000th=[  457], 20.000th=[  478], 30.000th=[  494], 40.000th=[  510],
     | 50.000th=[  529], 70.000th=[  562], 90.000th=[  881], 99.000th=[ 1004],
     | 99.900th=[ 1221], 99.990th=[ 1680], 99.999th=[17957]
   bw (  KiB/s): min=111484, max=211288, per=20.04%, avg=172705.38, stdev=36062.32, samples=236
   iops        : min=27871, max=52822, avg=43175.98, stdev=9015.56, samples=236
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=33.40%
  lat (usec)   : 750=50.21%, 1000=15.22%
  lat (msec)   : 2=1.17%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=29.12%, sys=69.98%, ctx=190207, majf=0, minf=166
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=6462328,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-write-4K-qd128: (groupid=7, jobs=4): err= 0: pid=1629: Thu Jul 18 21:55:03 2019
  write: IOPS=225k, BW=878MiB/s (921MB/s)(25.7GiB/30001msec)
    slat (usec): min=2, max=13976, avg=11.14, stdev=11.27
    clat (usec): min=14, max=28875, avg=553.96, stdev=252.08
     lat (usec): min=21, max=28879, avg=565.94, stdev=255.41
    clat percentiles (usec):
     | 10.000th=[  400], 20.000th=[  424], 30.000th=[  449], 40.000th=[  469],
     | 50.000th=[  486], 70.000th=[  523], 90.000th=[  947], 99.000th=[ 1483],
     | 99.900th=[ 1926], 99.990th=[ 3785], 99.999th=[10421]
   bw (  KiB/s): min=47762, max=298508, per=23.39%, avg=210268.28, stdev=64282.30, samples=236
   iops        : min=11940, max=74627, avg=52566.70, stdev=16070.55, samples=236
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=59.00%
  lat (usec)   : 750=28.47%, 1000=4.59%
  lat (msec)   : 2=7.86%, 4=0.08%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=31.22%, sys=67.80%, ctx=194821, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,6743615,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-rw-4K-qd128: (groupid=8, jobs=4): err= 0: pid=1638: Thu Jul 18 21:55:03 2019
   read: IOPS=154k, BW=600MiB/s (629MB/s)(17.6GiB/30001msec)
    slat (usec): min=2, max=2734, avg=11.86, stdev= 7.46
    clat (usec): min=15, max=3900, avg=566.98, stdev=178.30
     lat (usec): min=24, max=3965, avg=579.64, stdev=180.37
    clat percentiles (usec):
     | 10.000th=[  449], 20.000th=[  469], 30.000th=[  482], 40.000th=[  494],
     | 50.000th=[  506], 70.000th=[  537], 90.000th=[  889], 99.000th=[ 1057],
     | 99.900th=[ 1631], 99.990th=[ 3490], 99.999th=[ 3687]
   bw (  KiB/s): min=29384, max=197336, per=24.98%, avg=153552.61, stdev=36759.13, samples=236
   iops        : min= 7346, max=49334, avg=38388.12, stdev=9189.78, samples=236
  write: IOPS=65.8k, BW=257MiB/s (270MB/s)(7713MiB/30001msec)
    slat (usec): min=2, max=802, avg=12.11, stdev= 7.31
    clat (usec): min=13, max=3871, avg=566.83, stdev=178.54
     lat (usec): min=21, max=3916, avg=579.76, stdev=180.71
    clat percentiles (usec):
     | 10.000th=[  449], 20.000th=[  469], 30.000th=[  482], 40.000th=[  494],
     | 50.000th=[  506], 70.000th=[  537], 90.000th=[  889], 99.000th=[ 1057],
     | 99.900th=[ 1631], 99.990th=[ 3458], 99.999th=[ 3654]
   bw (  KiB/s): min=12240, max=85624, per=24.98%, avg=65766.53, stdev=15756.40, samples=236
   iops        : min= 3060, max=21406, avg=16441.61, stdev=3939.11, samples=236
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=44.89%
  lat (usec)   : 750=39.52%, 1000=13.34%
  lat (msec)   : 2=2.19%, 4=0.06%
  cpu          : usr=30.22%, sys=68.81%, ctx=205928, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=4610272,1974563,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=2438MiB/s (2557MB/s), 2438MiB/s-2438MiB/s (2557MB/s-2557MB/s), io=35.7GiB (38.4GB), run=15001-15001msec

Run status group 1 (all jobs):
   READ: bw=187MiB/s (196MB/s), 187MiB/s-187MiB/s (196MB/s-196MB/s), io=5615MiB (5888MB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=178MiB/s (187MB/s), 178MiB/s-178MiB/s (187MB/s-187MB/s), io=5350MiB (5609MB), run=30001-30001msec

Run status group 3 (all jobs):
   READ: bw=831MiB/s (871MB/s), 831MiB/s-831MiB/s (871MB/s-871MB/s), io=24.3GiB (26.1GB), run=30001-30001msec

Run status group 4 (all jobs):
  WRITE: bw=868MiB/s (910MB/s), 868MiB/s-868MiB/s (910MB/s-910MB/s), io=25.4GiB (27.3GB), run=30001-30001msec

Run status group 5 (all jobs):
   READ: bw=629MiB/s (660MB/s), 629MiB/s-629MiB/s (660MB/s-660MB/s), io=18.4GiB (19.8GB), run=30001-30001msec
  WRITE: bw=270MiB/s (283MB/s), 270MiB/s-270MiB/s (283MB/s-283MB/s), io=8093MiB (8486MB), run=30001-30001msec

Run status group 6 (all jobs):
   READ: bw=841MiB/s (882MB/s), 841MiB/s-841MiB/s (882MB/s-882MB/s), io=24.7GiB (26.5GB), run=30001-30001msec

Run status group 7 (all jobs):
  WRITE: bw=878MiB/s (921MB/s), 878MiB/s-878MiB/s (921MB/s-921MB/s), io=25.7GiB (27.6GB), run=30001-30001msec

Run status group 8 (all jobs):
   READ: bw=600MiB/s (629MB/s), 600MiB/s-600MiB/s (629MB/s-629MB/s), io=17.6GiB (18.9GB), run=30001-30001msec
  WRITE: bw=257MiB/s (270MB/s), 257MiB/s-257MiB/s (270MB/s-270MB/s), io=7713MiB (8088MB), run=30001-30001msec

Disk stats (read/write):
  sdb: ios=23713080/19111444, merge=0/0, ticks=447736/591328, in_queue=727376, util=74.27%